yanjainxiong/HDMCU_ZLG/HC32L136_SDK/4.集成开发环境支持包/HC32L136_IDE_Rev1.0.0/IAR_IDE/config/debugger/HDSC/HC32L136J8TA.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="SPI0">
            <name>SPI1</name>
            <description>desc SPI</description>
            <baseAddress>0x40004800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x18</size>
            </addressBlock>
        </peripheral>
        <peripheral>
            <name>SYSCTRL</name>
            <description>desc SYSCTRL</description>
            <baseAddress>0x40002000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x40</size>
            </addressBlock>
            <registers>
                <register>
                    <name>SYSCTRL0</name>
                    <description>desc SYSCTRL0</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x1</resetValue>
                    <resetMask>0x9FFF</resetMask>
                    <fields>
                        <field>
                            <name>RCH_EN</name>
                            <description>desc RCH_EN</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTH_EN</name>
                            <description>desc XTH_EN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCL_EN</name>
                            <description>desc RCL_EN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTL_EN</name>
                            <description>desc XTL_EN</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PLL_EN</name>
                            <description>desc PLL_EN</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLK_SW5_SEL</name>
                            <description>desc CLK_SW5_SEL</description>
                            <msb>7</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>HCLK_PRS</name>
                            <description>desc HCLK_PRS</description>
                            <msb>10</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCLK_PRS</name>
                            <description>desc PCLK_PRS</description>
                            <msb>12</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WAKEUP_BYRCH</name>
                            <description>desc WAKEUP_BYRCH</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTRL1</name>
                    <description>desc SYSCTRL1</description>
                    <addressOffset>0x4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x8</resetValue>
                    <resetMask>0xF7E</resetMask>
                    <fields>
                        <field>
                            <name>EXTH_EN</name>
                            <description>desc EXTH_EN</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EXTL_EN</name>
                            <description>desc EXTL_EN</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTL_ALWAYS_ON</name>
                            <description>desc XTL_ALWAYS_ON</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC_LPW</name>
                            <description>desc RTC_LPW</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LOCKUP_EN</name>
                            <description>desc LOCKUP_EN</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWD_USE_IO</name>
                            <description>desc SWD_USE_IO</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC_FREQ_ADJUST</name>
                            <description>desc RTC_FREQ_ADJUST</description>
                            <msb>11</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTRL2</name>
                    <description>desc SYSCTRL2</description>
                    <addressOffset>0x8</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SYSCTRL2</name>
                            <description>desc SYSCTRL2</description>
                            <msb>15</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCH_CR</name>
                    <description>desc RCH_CR</description>
                    <addressOffset>0xC</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x126</resetValue>
                    <resetMask>0xFFF</resetMask>
                    <fields>
                        <field>
                            <name>TRIM</name>
                            <description>desc TRIM</description>
                            <msb>10</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STABLE</name>
                            <description>desc STABLE</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTH_CR</name>
                    <description>desc XTH_CR</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x22</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>DRIVER</name>
                            <description>desc DRIVER</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>XTH_FSEL</name>
                            <description>desc XTH_FSEL</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STARTUP</name>
                            <description>desc STARTUP</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STABLE</name>
                            <description>desc STABLE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RCL_CR</name>
                    <description>desc RCL_CR</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x33F</resetValue>
                    <resetMask>0x1FFF</resetMask>
                    <fields>
                        <field>
                            <name>TRIM</name>
                            <description>desc TRIM</description>
                            <msb>9</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STARTUP</name>
                            <description>desc STARTUP</description>
                            <msb>11</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STABLE</name>
                            <description>desc STABLE</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XTL_CR</name>
                    <description>desc XTL_CR</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x21</resetValue>
                    <resetMask>0x7F</resetMask>
                    <fields>
                        <field>
                            <name>DRIVER</name>
                            <description>desc DRIVER</description>
                            <msb>1</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AMP_SEL</name>
                            <description>desc AMP_SEL</description>
                            <msb>3</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STARTUP</name>
                            <description>desc STARTUP</description>
                            <msb>5</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STABLE</name>
                            <description>desc STABLE</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PERI_CLKEN</name>
                    <description>desc PERI_CLKEN</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x80800000</resetValue>
                    <resetMask>0xFF7FEFFF</resetMask>
                    <fields>
                        <field>
                            <name>UART0</name>
                            <description>desc UART0</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>UART1</name>
                            <description>desc UART1</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPUART0</name>
                            <description>desc LPUART0</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPUART1</name>
                            <description>desc LPUART1</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C0</name>
                            <description>desc I2C0</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>I2C1</name>
                            <description>desc I2C1</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI0</name>
                            <description>desc SPI0</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPI1</name>
                            <description>desc SPI1</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BASETIM</name>
                            <description>desc BASETIM</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LPTIM</name>
                            <description>desc LPTIM</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADVTIM</name>
                            <description>desc ADVTIM</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TIM3</name>
                            <description>desc TIM3</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OPA</name>
                            <description>desc OPA</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCA</name>
                            <description>desc PCA</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WDT</name>
                            <description>desc WDT</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADC</name>
                            <description>desc ADC</description>
                            <msb>16</msb>
                            <lsb>16</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>VC</name>
                            <description>desc VC</description>
                            <msb>17</msb>
                            <lsb>17</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RNG</name>
                            <description>desc RNG</description>
                            <msb>18</msb>
                            <lsb>18</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>PCNT</name>
                            <description>desc PCNT</description>
                            <msb>19</msb>
                            <lsb>19</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RTC</name>
                            <description>desc RTC</description>
                            <msb>20</msb>
                            <lsb>20</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TRIM</name>
                            <description>desc TRIM</description>
                            <msb>21</msb>
                            <lsb>21</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LCD</name>
                            <description>desc LCD</description>
                            <msb>22</msb>
                            <lsb>22</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TICK</name>
                            <description>desc TICK</description>
                            <msb>24</msb>
                            <lsb>24</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SWD</name>
                            <description>desc SWD</description>
                            <msb>25</msb>
                            <lsb>25</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CRC</name>
                            <description>desc CRC</description>
                            <msb>26</msb>
                            <lsb>26</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AES</name>
                            <description>desc AES</description>
                            <msb>27</msb>
                            <lsb>27</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>GPIO</name>
                            <description>desc GPIO</description>
                            <msb>28</msb>
                            <lsb>28</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DMA</name>
                            <description>desc DMA</description>
                            <msb>29</msb>
                            <lsb>29</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>DIV</name>
                            <description>desc DIV</description>
                            <msb>30</msb>
                            <lsb>30</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FLASH</name>
                            <description>desc FLASH</description>
                            <msb>31</msb>
                            <lsb>31</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
